---
kind: property
id: P:Autodesk.Revit.DB.FabricationService.FabricationSystemName
source: html/f3911743-f9ff-2a97-02a1-4b6edb45b5df.htm
---
# Autodesk.Revit.DB.FabricationService.FabricationSystemName Property

The fabrication system name of the service.

## Syntax (C#)
```csharp
public string FabricationSystemName { get; }
```

## Remarks
A fabrication system in this context is a set of buttons that can be shared across fabrication services.
 It has nothing to do with other MEP systems in Revit.